app/controllers/users/registrations_controller.rb

  def user_exists?(email)
    User.exists?(email:)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ge1@g.com"], ["LIMIT", 1]]